Revit 2024 API
AlignedFreeFormSetOrientationOptions Enumeration
 Orientation options for Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum AlignedFreeFormSetOrientationOptions
Visual Basic
Public Enumeration AlignedFreeFormSetOrientationOptions
Visual C++
public enum class AlignedFreeFormSetOrientationOptions
Members
Member name | Description
AlignedToDistributionPath |  Cutting planes are perpendicular to the distribution path.
Vertical |  Cutting planes are oriented vertically, X or Y vector being Z axis.
ParallelToFace |  Cutting planes are parallel to a selected planar face.
PerpendicularToFace |  Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.
See Also
Autodesk.Revit.DB.Structure Namespace